ns96/STM32DiscVU/Core/Src/VisualizerApp.c
// --- Global State ---
bool g_ShowSpectrum = true;
bool g_ShowVUMeter = true;
bool g_ShowWaterfall = false;
bool g_SimulationMode = true;
bool g_InputLineIn = false;
bool g_EnablePeakHold = true;
bool g_ShowFSK = false;
bool g_ShowPCMF1 = false;
bool g_ShowFSKEncode = false;
char g_EncodeSide = 'A';
int g_EncodeDuration = 45;
volatile bool g_IsEncoding = false;
int g_EncodeSeconds = 0;
uint32_t g_LastEncodeTick = 0;
FSK_Modem g_TxModem;
int g_SpectrumMode = 0;
static const int splitX = 240;
static void UpdateFSKEncode(void);
static void drawPCMF1(void);

// PCM-F1 State
#define PCMF1_RING_SIZE 2048
static int16_t g_PCMF1_RingL[PCMF1_RING_SIZE];
static int16_t g_PCMF1_RingR[PCMF1_RING_SIZE];
static uint32_t g_PCMF1_RingIdx = 0;
static uint16_t enc_hist_w[128][6] = {{0}};
static uint16_t enc_hist_p[128] = {0};
static uint16_t enc_hist_q[128] = {0};
static uint32_t global_enc_line = 0;

// --- Aesthetics Settings ---
bool g_EnableAesthetics = true;

// EMA filter state for each of the 62 ISO bands. Max bands is 62.
static float g_BarLevels[62] = {0.0f};

// A-Weighting curve approximations scaled for the 62 bands.
// Attenuates sub-bass (bands 0-10), neutral lower-mids, boosts upper-mids (bands 30-50), attenuates extreme highs.
static const float g_AWeightingCurve[62] = {
    0.10f, 0.12f, 0.15f, 0.18f, 0.22f, 0.26f, 0.31f, 0.36f, 0.42f, 0.49f, // 1-10 (Sub-bass: heavy cut)
    0.56f, 0.64f, 0.72f, 0.81f, 0.90f, 0.99f, 1.09f, 1.19f, 1.29f, 1.39f, // 11-20 (Bass: moderate cut to neutral)
    1.49f, 1.58f, 1.67f, 1.76f, 1.84f, 1.91f, 1.98f, 2.05f, 2.11f, 2.16f, // 21-30 (Low-mids to mids: smooth boost)
    2.21f, 2.25f, 2.28f, 2.30f, 2.32f, 2.34f, 2.35f, 2.36f, 2.36f, 2.35f, // 31-40 (Upper-mids: peak sensitivity)
    2.34f, 2.32f, 2.29f, 2.25f, 2.20f, 2.14f, 2.08f, 2.00f, 1.92f, 1.83f, // 41-50 (Highs: gentle roll-off)
    1.73f, 1.62f, 1.50f, 1.38f, 1.25f, 1.11f, 0.97f, 0.82f, 0.66f, 0.50f, // 51-60 (Upper highs: steeper roll-off)
    0.33f, 0.15f // 61-62 (Air: cut)
};

// --- Spectrum Colors (Customizable) ---
#define COLOR_SPEC_L  LCD_COLOR_YELLOW
#define COLOR_SPEC_R  LCD_COLOR_RED

// --- UI Layout ---
#define UI_HEADER_H      30
#define UI_VIZ_TOP       30
#define UI_VIZ_BOTTOM    230
#define UI_FOOTER_Y      230

// --- Global System Tuning ---
// Baud Correction: If the measured baud rate is off, adjust this factor.
// Example: If measured baud is 5% high (e.g. 1260 instead of 1200), set this to 1.05f.
// Example: If measured baud is 5% low (e.g. 1140 instead of 1200), set this to 0.95f.
float g_BaudCorrectionFactor = 1.01f; 

// --- Optimization / Sensitivity Settings ---
float g_SpectrumGain = 6.0f;
float g_WaterfallGain = 6.0f; 
float g_MicGain = 24.0f;      // Standard gain for microphones
float g_LineInGain = 0.75f;   // lower default gain for line-in
float g_AudioGain = 24.0f;    // Active gain used in processing
float g_VUGain = 2.0f;
float g_PeakDecay = 10.0f;     // Pixels per frame to fall
float g_VUDecay = 0.80f;      // Exponential fall per frame (0.80-0.90 for fast response)
float g_FSKGain = 10.0f;       // Boost for FSK processing (5.0-10.0 typical)
int g_PeakHoldFrames = 5;    // Frames to hold peak before falling
static float vu_gain_vals[] = {0.5f, 1.0f, 2.0f, 4.0f, 8.0f};
static const char* vu_gain_texts[] = {"x0.5", "x1", "x2", "x4", "x8"};
static int vu_gain_idx = 2; // Default to 2.0
static bool g_GainAlwaysActive = true;

// --- Buffers & Double Buffering State ---
static uint32_t fb_addresses[2] = { LCD_FB_START_ADDRESS, LCD_FB_START_ADDRESS + LCD_FB_OFFSET };
#define WFALL_FB_ADDRESS (LCD_FB_START_ADDRESS + 2 * LCD_FB_OFFSET)
#define WFALL_WIDTH  480
#define WFALL_HEIGHT 200 // UI_FOOTER_Y - UI_HEADER_H
static int g_WfallHead = 0; // Circular buffer head pointer
static int front_buffer_idx = 0;

// --- CPU Load State ---
extern volatile uint32_t g_IdleTicks;
static uint32_t cpu_baseline = 0;
static uint32_t last_idle_val = 0;
static uint32_t last_cpu_tick = 0;
static int current_cpu_load = 0;

// --- Audio / Viz State ---
static float vReal[FFT_SIZE];
static float vImag[FFT_SIZE];
static float vRealFFT[FFT_SIZE];
static float vImagFFT[FFT_SIZE];

// Separate buffers for Stereo Split mode
static float vRealL[FFT_SIZE];
static float vRealR[FFT_SIZE];
static float vRealFFTL[FFT_SIZE];
static float vRealFFTR[FFT_SIZE];

static uint16_t fftIdx = 0;
static float peakL = 0.0f;
static float peakR = 0.0f;
static uint8_t fft_mag_sim[64]; 

// --- Peak Hold State ---
static float g_SpectrumPeaks[128];
static uint8_t g_PeakHoldCount[128];
static float g_VUPeaks[2]; // 0=L, 1=R
static uint8_t g_VUPeakHoldCount[2];

// --- Database & Metadata ---
static AudioInfo g_CurrentTrack;
static bool g_HasMetadata = false;

// --- ISO Standard Frequency Mappings (256 FFT Bins -> Octave Bands) ---

// 31-Band (1/3 Octave) for Stereo Split (31 Left + 31 Right = 62)
static const uint8_t g_ISO31_Map[31][2] = {
    {1,2},   {2,3},   {3,4},   {4,5},   {5,6},   {6,7},   {7,8},   {8,10},
    {10,12}, {12,15}, {15,18}, {18,22}, {22,27}, {27,33}, {33,40}, {40,49}, 
    {49,60}, {60,73}, {73,89}, {89,109},{109,133},{133,163},{163,190},{190,210},
    {210,225},{225,235},{235,245},{245,250},{250,253},{253,254},{254,255}
};

// 62-Band (1/6 Octave) for Mono Mode (Full Display)
static const uint8_t g_ISO62_Map[62][2] = {
    {1,2},   {2,3},   {3,4},   {4,5},   {5,6},   {6,7},   {7,8},   {8,9},   {9,10},  {10,11},
    {11,12}, {12,13}, {13,14}, {14,15}, {15,17}, {17,19}, {19,21}, {21,23}, {23,26}, {26,29},
    {29,32}, {32,35}, {35,39}, {39,43}, {43,47}, {47,52}, {52,57}, {57,63}, {63,69}, {69,76},
    {76,84}, {84,92}, {92,101},{101,111},{111,122},{122,134},{134,147},{147,161},{161,176},{176,193},
    {193,200},{200,205},{205,210},{210,215},{215,220},{220,225},{225,230},{230,234},{234,238},{238,242},
    {242,245},{245,248},{248,251},{251,253},{253,254},{254,255},{255,255},{255,255},{255,255},{255,255},
    {255,255},{255,255}
};

// Helper to convert magnitude to Log-dB Bar Height
static int getLogBarHeight(float* fftData, int barIdx, int maxH, float gain, const uint8_t map[][2], int numBands) {
    if (barIdx < 0 || barIdx >= numBands) return 0;
    int bS = map[barIdx][0];
    int bE = map[barIdx][1];
    
    // Energy Estimation: Use RMS across the band
    float energySum = 0;
    if (bE > bS) {
        for(int b=bS; b<bE; b++) {
            float m = fftData[b];
            energySum += m * m;
        }
        energySum = sqrtf(energySum / (float)(bE - bS));
    } else {
        energySum = fftData[bS];
    }
    
