ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    if (g_EnableAesthetics) {
        // Apply A-Weighting (perceived loudness contour)
        // If we are in 31-band stereo split, map it across the 62-band curve
        int curveIdx = (numBands == 31) ? (barIdx * 2) : barIdx;
        if (curveIdx > 61) curveIdx = 61;
        energySum *= g_AWeightingCurve[curveIdx];
    }
    
    float val = energySum * gain;
    float db = 0;
    
    if (val > 0.0001f) {
        db = 20.0f * log10f(val + 1.0f); 
    }
    
    // Adjust thresholds if aesthetics are on to compensate for the higher multipliers in the mid-range
    float maxDb = g_EnableAesthetics ? 55.0f : 48.0f; 
    float minDb = g_EnableAesthetics ? 18.0f : 12.0f; 
    
    float target_h = 0;
    if (db >= minDb) {
        if (db > maxDb) db = maxDb;
        target_h = ((db - minDb) / (maxDb - minDb)) * (float)maxH;
    }

    if (!g_EnableAesthetics) {
        return (int)target_h;
    }

    // --- Temporal Smoothing (Attack/Decay Envelope) ---
    // Make sure we have enough state allocated - we allocated 62 above. 
    // For 31 band split L/R, map right channel to indices 31-61.
    // However, getLogBarHeight doesn't inherently know if it's L or R because it's called per channel array.
    // A quick hack is to use a static pointer within the caller, but right now we only have barIdx.
    // Let's use a static rolling index or base it on memory address to uniquely track state.
    
    // Wait, getLogBarHeight is called consecutively for L then R.
    // We need unique state indices. Let's pass a true global state index.
    // Actually, modifying the signature of getLogBarHeight is better to give it an absolute index for state tracking.
    
    // Instead of changing signature right away, we can derive the absolute state index:
    // If numBands is 62 (Mono), 0-61.
    // If numBands is 31 (Split), determine if it's left or right based on the array pointer.
    extern float vRealFFTR[FFT_SIZE]; // Check if we are passing the right channel
    int stateIdx = barIdx;
    if (numBands == 31 && fftData == vRealFFTR) {
        stateIdx = barIdx + 31; // Shift right channel state up
    }
    
    float current_level = g_BarLevels[stateIdx];
    
    if (target_h > current_level) {
        // Fast Attack
        current_level = (target_h * 0.7f) + (current_level * 0.3f);
    } else {
        // Slow Decay (Gravity)
        current_level = (target_h * 0.10f) + (current_level * 0.90f);
    }
    
    g_BarLevels[stateIdx] = current_level;
    
    return (int)current_level;
}

// --- FSK Decoder State ---
FSK_Modem g_Modem;
static char g_FSKText[2048]; // Large scrollable buffer
static int g_FSKTextLen = 0;

// --- TapeTester Stats (Pure C) ---
typedef struct {
    int logLineCount;
    int dataErrors;
    int dataLengthErrors;
    int numberConversionErrors;
    int invalidCharacterErrors;
    int stopRecords;
    int totalStops;
    int sideAErrors;
    int sideALineCount;
    int sideBErrors;
    int sideBLineCount;
    char currentSide;
    bool isDctMode;
    int lastTotalTime;
} TapeStats;

static TapeStats g_TapeStats = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 'A', false};
static char g_CurrentLineBuf[64];
static int g_CurrentLineIdx = 0;

// Offload State for Main Thread
volatile bool g_LineReady = false;
char g_ReadyLineBuf[64];
char g_CurrentMappedRecord[32] = ""; // Fixed header for DCT mapping

static void Tape_ProcessLine(char* line) {
    if (!line || line[0] == 0) return;
    
    // Trim trailing whitespace for robust statistics counting
    int len = strlen(line);
    while (len > 0 && (line[len-1] == ' ' || line[len-1] == '\t' || line[len-1] == '\r' || line[len-1] == '\n')) {
        line[--len] = '\0';
    }
    
    // 1. Carrier Lost Check
    if (strstr(line, "### NOCARRIER") != NULL) {
        if (g_TapeStats.stopRecords == 0) g_TapeStats.totalStops++;
        g_TapeStats.stopRecords++;
        g_HasMetadata = false; // Clear on stop
        g_CurrentMappedRecord[0] = '\0'; // Clear fixed header on stop
        return;
    }

    // 2. Valid Data Record Check (Strictly 29 chars to match generic records)
    if (len == 29 && line[0] != '#') {
        g_TapeStats.logLineCount++;
        if (g_TapeStats.currentSide == 'A') g_TapeStats.sideALineCount++;
        else g_TapeStats.sideBLineCount++;
        g_TapeStats.stopRecords = 0;

        // Split fields (ID_TRACK_HASH_TIME_TOTAL)
        char lineCopy[32];
        strncpy(lineCopy, line, sizeof(lineCopy));
        char* parts[5];
        int pCount = 0;
        char* tok = strtok(lineCopy, "_");
        while(tok && pCount < 5) {
            parts[pCount++] = tok;
            tok = strtok(NULL, "_");
        }

        if (pCount == 5) {
            char* tapeId = parts[0];
            char* hash = parts[2];
            
            // Side Detection
            int idLen = strlen(tapeId);
            if (idLen > 0) {
                char side = tapeId[idLen-1];
                if (side == 'A' || side == 'a') g_TapeStats.currentSide = 'A';
                else if (side == 'B' || side == 'b') g_TapeStats.currentSide = 'B';
            }

            // DCT Auto-Detect Check
            if (strcmp(tapeId, "DCT0A") == 0 || strcmp(tapeId, "DCT0B") == 0) {
                if (!g_TapeStats.isDctMode) {
                     printf("[DCT] Auto-Detected! Mode Enabled.\r\n");
                     g_TapeStats.isDctMode = true;
                }
            } else {
                if (g_TapeStats.isDctMode) {
                     printf("[DCT] Tape Changed. Mode Disabled.\r\n");
                     g_TapeStats.isDctMode = false;
                }
            }

            // Database Lookup (DCT vs Generic)
            char lookupHash[16] = {0};
            bool readyToLookup = false;

            if (g_TapeStats.isDctMode) {
                // DCT Mode: Use Timecode to find Real Hash and Full Line from side file
                int totalTime = atoi(parts[4]);
                g_TapeStats.lastTotalTime = totalTime;
                char mappedFullLine[32] = {0};
                if (GetMappedRecord(g_TapeStats.currentSide, totalTime, lookupHash, mappedFullLine)) {
                    readyToLookup = true;
                    // Update the fixed header instead of interspersing in the log
                    strncpy(g_CurrentMappedRecord, mappedFullLine, sizeof(g_CurrentMappedRecord)-1);
                    g_CurrentMappedRecord[sizeof(g_CurrentMappedRecord)-1] = '\0';
                } else {
                    // Optional: Print only if changed or verbose?
                    // printf("[DCT] No Map for Time: %d\r\n", totalTime);
                }
            } else {
                // Generic Mode: Use the Hash directly from the line
                g_TapeStats.lastTotalTime = atoi(parts[4]);
                if (strlen(hash) == 10) {
                    strncpy(lookupHash, hash, 11);
                    readyToLookup = true;
                }
            }

            if (readyToLookup) {
                static char lastLookupHash[16] = "";
                // Check if the TRACK changed (hash changed) OR if we don't have metadata yet
                if (strcmp(lookupHash, lastLookupHash) != 0 || !g_HasMetadata) {
                    strcpy(lastLookupHash, lookupHash);
                    
