ns96/STM32DiscVU/Core/Src/VisualizerApp.c
                    if (DBM_GetAudioInfo(lookupHash, &g_CurrentTrack)) {
                        g_HasMetadata = true;
                        printf("[DBM] Found: %s\r\n", g_CurrentTrack.sourcePath);
                    } else {
                        g_HasMetadata = false;
                    }
                }
            }
        } else {
            g_TapeStats.dataErrors++;
        }
    } else if (strchr(line, '_') != NULL && strstr(line, "###") == NULL) {
        g_TapeStats.dataLengthErrors++;
        g_TapeStats.dataErrors++;
        if (g_TapeStats.currentSide == 'A') g_TapeStats.sideAErrors++;
        else g_TapeStats.sideBErrors++;
    }
}

void addFSKChar(char c) {
    // Thread Safety: This can be called from Modem Task (background) 
    // and from Main Loop (Tape_ProcessLine injections).
    vTaskSuspendAll();

    // 1. Add to scroll buffer (Simple char array, safe for single-writer/single-reader)
    if (g_FSKTextLen < sizeof(g_FSKText) - 1) {
        g_FSKText[g_FSKTextLen++] = c;
        g_FSKText[g_FSKTextLen] = '\0';
    } else {
        memmove(g_FSKText, g_FSKText + 1, sizeof(g_FSKText) - 1);
        g_FSKText[sizeof(g_FSKText) - 2] = c;
        g_FSKText[sizeof(g_FSKText) - 1] = '\0';
    }

    // 2. Add to line buffer for TapeStats (Only called from Modem task / Main loop)
    if (c == '\n' || c == '\r') {
        if (g_CurrentLineIdx > 0) {
            g_CurrentLineBuf[g_CurrentLineIdx] = '\0';
            
            // Offload: Copy to ready buffer and signal main thread
            // This prevents blocking the modem task with SD Card I/O
            if (!g_LineReady) {
                strncpy(g_ReadyLineBuf, g_CurrentLineBuf, sizeof(g_ReadyLineBuf));
                // Only signal if not a control message (unless we want to log it)
                g_LineReady = true; 
            }
            
            g_CurrentLineIdx = 0;
        }
    } else if (g_CurrentLineIdx < sizeof(g_CurrentLineBuf) - 1) {
        g_CurrentLineBuf[g_CurrentLineIdx++] = c;
    }

    xTaskResumeAll();
}

void addFSKDisplayChar(char c) {
    vTaskSuspendAll();
    // Only update the scroll buffer, NEVER the line buffer used for stats
    if (g_FSKTextLen < sizeof(g_FSKText) - 1) {
        g_FSKText[g_FSKTextLen++] = c;
        g_FSKText[g_FSKTextLen] = '\0';
    } else {
        memmove(g_FSKText, g_FSKText + 1, sizeof(g_FSKText) - 1);
        g_FSKText[sizeof(g_FSKText) - 2] = c;
        g_FSKText[sizeof(g_FSKText) - 1] = '\0';
    }
    xTaskResumeAll();
}

void addFSKDisplayString(const char* s) {
    if (!s) return;
    while (*s) {
        addFSKDisplayChar(*s++);
    }
}


// --- Custom Waterfall Color Scheme (Light Blue -> Brown -> Orange) ---
static uint32_t wfall_lut[256];
static void initWaterfallLUT(void) {
    for (int i = 0; i < 256; i++) {
        // Simple linear interpolation
        // 0: Light Blue (173, 216, 230)
        // 128: Brown (139, 69, 19)
        // 255: Orange (255, 165, 0)
        int r, g, b;
        if (i < 128) {
            // 0: Deep Blue (0, 80, 255) - Reduced green for "more blue" look
            // 128: Rich Brown (139, 69, 19)
            float f = i / 128.0f;
            r = (int)(0   * (1.0f - f) + 139 * f);
            g = (int)(80  * (1.0f - f) + 69  * f);
            b = (int)(255 * (1.0f - f) + 19  * f);
        } else {
            // 128: Brown (139, 69, 19)
            // 255: Orange (255, 140, 0)
            float f = (i - 128) / 127.0f;
            r = (int)(139 * (1.0f - f) + 255 * f);
            g = (int)(69  * (1.0f - f) + 140 * f);
            b = (int)(19  * (1.0f - f) + 0   * f);
        }
        wfall_lut[i] = 0xFF000000 | (r << 16) | (g << 8) | b;
    }
}

static uint16_t crc16_ccitt(uint8_t *bits, int offset, int len) {
    uint16_t crc = 0x0000;
    for (int i = 0; i < len; i++) {
        uint8_t crc_bit = (crc & 0x8000) ? 1 : 0;
        crc <<= 1;
        if (bits[offset + i] ^ crc_bit) crc ^= 0x1021;
    }
    return crc;
}

// --- UI State ---
#define MAX_BUTTONS 7
static Button buttons[MAX_BUTTONS];
static int buttonCount = 0;
static bool ts_enabled = false;

// --- Prototypes ---
static void drawSpectrum(void);
static void drawVU(void);
static void drawWaterfall(void);
static void cycleBaudRate(void);
static void initFSKModems(void); // New helper to sync both
static void initButtons(void);
static void handleTouch(void);
static void toggleSpectrum(void);
static void toggleWaterfall(void);
static void toggleVU(void);
static void toggleSim(void);
static void toggleInput(void);
static void cycleVUGain(void);
static void toggleFSK(void);
static void drawFSKText(void);
static void Visualizer_InitAudio(void);
static uint32_t Color565ToARGB(uint16_t rgb565);
static void FillRectDMA2D(uint32_t* fb, int x, int y, int w, int h, uint32_t color);

static uint32_t heatARGB[256];

static void initSpectrumLUT(void) {
    for (int i = 0; i < 256; i++) {
        heatARGB[i] = Color565ToARGB(heat565[i]);
    }
}

static void FillRectCPU(uint32_t* fb, int x, int y, int w, int h, uint32_t color) {
    if (x < 0) { w += x; x = 0; }
    if (y < 0) { h += y; y = 0; }
    if (x + w > 480) w = 480 - x;
    if (y + h > 272) h = 272 - y;
    if (w <= 0 || h <= 0) return;

    for (int py = 0; py < h; py++) {
        uint32_t* row = &fb[(y + py) * 480 + x];
        for (int px = 0; px < w; px++) {
            row[px] = color;
        }
    }
}

// --- Initialization ---
void Visualizer_Init(void) {
    uint8_t status;
    
    printf("Visualizer_Init: Starting LCD/TS Init...\r\n");
    status = BSP_LCD_Init();
    if (status != LCD_OK) printf("BSP_LCD_Init FAILED\r\n");

    BSP_LCD_LayerDefaultInit(0, LCD_FB_START_ADDRESS);

    BSP_LCD_SelectLayer(0);
    BSP_LCD_DisplayOn();
    BSP_LCD_Clear(LCD_COLOR_BLACK);
    
    // Initialize FFT LUTs
    SimpleFFT_Init();
    
    status = BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());
    ts_enabled = (status == TS_OK);
    
    // FSK Modems initialization: Force default to 1200 baud
    g_BaudIdx = 2;
    g_BaudRate = 1200.0f;
    initFSKModems();
    printf("VisualizerApp: FSK Decoder ready (1200 Baud)...\r\n");
    
