ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    printf("VisualizerApp: Clearing Waterfall Buffer in SDRAM...\r\n");
    initWaterfallLUT(); // CRITICAL: Restore LUT initialization
    initSpectrumLUT();  // Precompute spectrum ARGB colors
    uint32_t bgColor = wfall_lut[0];
    uint32_t* ptr = (uint32_t*)WFALL_FB_ADDRESS;
    for(int i=0; i<WFALL_WIDTH * WFALL_HEIGHT; i++) ptr[i] = bgColor;
    // Commit to SDRAM so DMA2D doesn't see garbage on first scroll
    SCB_CleanDCache_by_Addr((uint32_t*)WFALL_FB_ADDRESS, WFALL_WIDTH * WFALL_HEIGHT * 4);

    // Calibrate CPU baseline (idle ticks over 100ms)
    printf("VisualizerApp: Calibrating CPU...\r\n");
    g_IdleTicks = 0;
    osDelay(100); // Use osDelay to yield to Idle task
    cpu_baseline = g_IdleTicks;
    if (cpu_baseline == 0) cpu_baseline = 1; // Prevent div by zero
    last_idle_val = g_IdleTicks;
    last_cpu_tick = HAL_GetTick();
    
    printf("VisualizerApp: initButtons...\r\n");
    initButtons();
    
    printf("VisualizerApp: Visualizer_InitAudio...\r\n");
    Visualizer_InitAudio();

    printf("VisualizerApp: Checking SD Card status...\r\n");
    
    // Set Font and Background for loading messages
    BSP_LCD_SetFont(&Font20);
    BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);

    if (BSP_SD_IsDetected() == SD_PRESENT) {
        printf("VisualizerApp: SD Card DETECTED. Proceeding with DB Init.\r\n");
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"Loading AUDIODB...", CENTER_MODE);
        printf("VisualizerApp: DBM_Init (SDRAM @ 0xC0500000)...\r\n");
        // Use Uppercase for 8.3 compatibility as LFN is disabled in ffconf.h
        if (!DBM_Init("/AUDIODB.TXT", 0xC0500000)) {
            printf("VisualizerApp: DBM_Init FAILED!\r\n");
            BSP_LCD_SetTextColor(LCD_COLOR_RED);
            BSP_LCD_DisplayStringAt(0, 150, (uint8_t*)"DB Load Failed!", CENTER_MODE);
        }

        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"Loading Side Maps...", CENTER_MODE);
        printf("VisualizerApp: Loading Side Maps (RAM)...\r\n");
        g_SideACount = LoadSideMap('A', SIDE_MAP_A_ADDR);
        g_SideBCount = LoadSideMap('B', SIDE_MAP_B_ADDR);
        
    } else {
        printf("VisualizerApp: SD Card NOT DETECTED! Skipping Database Load.\r\n");
        printf("VisualizerApp: System will run in Visualizer-Only mode.\r\n");
        
        BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
        BSP_LCD_FillRect(0, 120, 480, Font20.Height);
        BSP_LCD_SetTextColor(LCD_COLOR_RED);
        BSP_LCD_DisplayStringAt(0, 120, (uint8_t*)"SD Card NOT DETECTED!", CENTER_MODE);
        
        g_SideACount = 0;
        g_SideBCount = 0;
        // DBM is static/global, so it naturally stays uninitialized (empty index)
    }

    // Final Cleanup: Clear screen one more time to Layer 0 before visualizer loop starts
    // This ensures no artifacts like "LLoading" remain.
    BSP_LCD_Clear(LCD_COLOR_BLACK);
    
    printf("VisualizerApp: Init sequence complete.\r\n");
}

void Visualizer_ProcessAudio(int16_t* inBuf, uint32_t samples) {
    extern volatile bool g_IsEncoding;
    if (g_IsEncoding) g_SimulationMode = false; // Force real view during encoding

    // PCM-F1 Ring Buffer (Always store raw samples for bit-stream visualization)
    uint32_t step = 4;
    for (uint32_t i = 0; i < samples; i += step) {
        int16_t sL, sR;
        if (g_SimulationMode && !g_IsEncoding) {
            static float p = 0.0f;
            sL = (int16_t)(sinf(p) * 16383.0f);
            sR = (int16_t)(cosf(p * 0.9f) * 16383.0f);
            p += 0.05f; 
            if (p > 6.283185f) p -= 6.283185f;
        } else {
            int32_t sL_sum = (int32_t)inBuf[i] + (int32_t)inBuf[i + 1];
            int32_t sR_sum = (int32_t)inBuf[i + 2] + (int32_t)inBuf[i + 3];
            // Clamp to 16-bit
            if (sL_sum > 32767) sL_sum = 32767; else if (sL_sum < -32768) sL_sum = -32768;
            if (sR_sum > 32767) sR_sum = 32767; else if (sR_sum < -32768) sR_sum = -32768;
            sL = (int16_t)sL_sum;
            sR = (int16_t)sR_sum;
        }
        g_PCMF1_RingL[g_PCMF1_RingIdx] = sL;
        g_PCMF1_RingR[g_PCMF1_RingIdx] = sR;
        g_PCMF1_RingIdx = (g_PCMF1_RingIdx + 1) % PCMF1_RING_SIZE;
    }

    if (g_SimulationMode && !g_IsEncoding) return;

    // Cache management is handled by the caller (main.c)

// 1. FSK Processing moved to StartModemTask in main.c

    // Debug Print every 1s (approx)
    if (HAL_GetTick() - g_LastDebugTime > 1000) {
        g_LastDebugTime = HAL_GetTick();
        // FSK DIAGNOSTICS (moved from interrupt context)
        if (g_ShowFSK) {
            // FSK Diagnostics could be added here using public members like g_Modem.lastSNR
            // printf("[FSK] SNR: %d.%02d\n", (int)g_Modem.lastSNR, (int)(g_Modem.lastSNR * 100) % 100);
        }
        g_MaxSignalLevel = 0.0f; // Reset peak hold
    }

    float sumSqL = 0, sumSqR = 0;
    for (uint32_t i = 0; i < samples; i += step) {
        float sL = ((float)inBuf[i] + (float)inBuf[i + 1]) / 32768.0f;
        float sR = ((float)inBuf[i + 2] + (float)inBuf[i + 3]) / 32768.0f;
        sumSqL += sL * sL;
        sumSqR += sR * sR;
    }
    
    // Instant Attack for RMS (with gain alignment)
    uint32_t numFrames = samples / step;
    float currentGain = g_IsEncoding ? 1.0f : g_AudioGain;
    float instantRmsL = sqrtf(sumSqL / numFrames) * currentGain;
    float instantRmsR = sqrtf(sumSqR / numFrames) * currentGain;
    
    if (instantRmsL > peakL) peakL = instantRmsL;
    if (instantRmsR > peakR) peakR = instantRmsR;

    // 3. Process decimated stream for FFT
    for (uint32_t i = 0; i < samples; i += step * RX_DECIMATION) {
        int32_t sumL = 0, sumR = 0;
        for (int j = 0; j < RX_DECIMATION; j++) {
            sumL += inBuf[i + j * step] + inBuf[i + j * step + 1];
            sumR += inBuf[i + j * step + 2] + inBuf[i + j * step + 3];
        }
        
        float rawL = (float)(sumL / RX_DECIMATION) / 32768.0f;
        float rawR = (float)(sumR / RX_DECIMATION) / 32768.0f;
        float mono = (rawL + rawR) * 0.5f;
        
        static float dc_offset = 0.0f;
        dc_offset = 0.999f * dc_offset + 0.001f * mono;
        float clean = (mono - dc_offset) * g_AudioGain;
        
        if (fftIdx < FFT_SIZE) {
            vReal[fftIdx] = clean;
            vImag[fftIdx] = 0.0f;
            vRealL[fftIdx] = rawL * currentGain;
            vRealR[fftIdx] = rawR * currentGain;
            fftIdx++;
        }
    }
}

void Visualizer_Update(void) {
    handleTouch();
    osDelay(5); // Reduce CPU load
    UpdateFSKEncode(); // Background encoding (even if panel hidden)
    
    int back_idx = 1 - front_buffer_idx;
    uint32_t back_addr = fb_addresses[back_idx];
    uint32_t* back_fb = (uint32_t*)back_addr;

    // --- Prepare Hidden Buffer for Drawing ---
    // We ONLY update the internal pointers here. 
    // DO NOT trigger a hardware reload yet! This fixes the flickering.
    hLtdcHandler.LayerCfg[0].FBStartAdress = back_addr; 
    
    // Invalidate D-Cache for the HUD and Viz area only
    SCB_InvalidateDCache_by_Addr((uint32_t*)back_addr, 480 * UI_VIZ_BOTTOM * 4);

