ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    // Targeted Screen Clear (DMA2D) - Full Height (272)
    // We restore full clear to ensure double-buffer consistency until partial updates are perfect.
    FillRectDMA2D(back_fb, 0, 0, 480, 272, LCD_COLOR_BLACK);

    if (g_SimulationMode) {
        static float simP = 0.0f; simP += 0.04f; // Slower simulation for smoother look
        peakL = (sinf(simP) + 1.0f) * 0.5f; peakR = (cosf(simP * 1.3f) + 1.0f) * 0.5f;
        for(int i=0; i<64; i++) fft_mag_sim[i] = (uint8_t)((sinf(simP + i*0.2f) + 1.0f) * 127.0f);
    } else if (fftIdx >= FFT_SIZE) {
        // 1. Process FFT with 50% overlap (every 256 samples)
        if (g_SpectrumMode == 1 || g_SpectrumMode == 3) {
            // Compute Left FFT
            memcpy(vRealFFT, vRealL, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
            memcpy(vRealFFTL, vRealFFT, sizeof(vRealFFTL));

            // Compute Right FFT
            memcpy(vRealFFT, vRealR, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
            memcpy(vRealFFTR, vRealFFT, sizeof(vRealFFTR));
            
            // OPTIMIZATION: Synthesize Mono for Waterfall from L/R to avoid 3rd FFT
            if (g_ShowWaterfall) {
                for(int i=0; i<FFT_SIZE/2; i++) {
                    vRealFFT[i] = (vRealFFTL[i] + vRealFFTR[i]) * 0.5f;
                }
            }
        } else {
            // Standard Mono FFT
            memcpy(vRealFFT, vReal, sizeof(vRealFFT)); 
            memset(vImagFFT, 0, sizeof(vImagFFT));
            SimpleFFT_Windowing_Fast(vRealFFT, FFT_SIZE);
            SimpleFFT_Compute(vRealFFT, vImagFFT, FFT_SIZE);
            SimpleFFT_ComplexToMagnitude(vRealFFT, vImagFFT, FFT_SIZE);
        }
        
        // --- 50% Overlap Buffer Shift ---
        int shift = 256;
        memmove(vReal, vReal + shift, (FFT_SIZE - shift) * sizeof(float));
        memmove(vRealL, vRealL + shift, (FFT_SIZE - shift) * sizeof(float));
        memmove(vRealR, vRealR + shift, (FFT_SIZE - shift) * sizeof(float));
        fftIdx = 256;
    }

    // Decay: Smoothly drop meters in UI loop
    peakL *= g_VUDecay;
    peakR *= g_VUDecay;
    
    // Global Spectrum Peak Decay
    int totalPeaks = 62; // Always 62 bands in both Mono and Split
    for(int i=0; i<totalPeaks; i++) {
        if (g_PeakHoldCount[i] > 0) g_PeakHoldCount[i]--;
        else if (g_SpectrumPeaks[i] > 0) g_SpectrumPeaks[i] -= g_PeakDecay;
    }

    // VU Peak Decay
    for(int i=0; i<2; i++) {
        if (g_VUPeakHoldCount[i] > 0) g_VUPeakHoldCount[i]--;
        else if (g_VUPeaks[i] > 0) g_VUPeaks[i] -= (g_PeakDecay * 2.0f); // Fast horizontal fall
    }

    // 2. Draw Visualizations (Background layer)
    if (g_ShowWaterfall) {
        if (g_ShowPCMF1) drawPCMF1();
        else drawWaterfall();
    }
    else if (g_ShowSpectrum) drawSpectrum();
    
    if (g_ShowFSK) drawFSKText();

    // Calculate CPU Load every 500ms
    uint32_t now = HAL_GetTick();
    if (now - last_cpu_tick >= 500) {
        uint32_t diff = g_IdleTicks - last_idle_val;
        float expected = (float)cpu_baseline * (float)(now - last_cpu_tick) / 100.0f;
        if (expected > 0) {
            float load = 100.0f * (1.0f - (float)diff / expected);
            if (load < 0) load = 0;
            if (load > 100) load = 100;
            current_cpu_load = (int)load;
        }
        last_idle_val = g_IdleTicks;
        last_cpu_tick = now;
    }

    // 3. Draw HUD elements (Header) - ALWAYS draw to avoid flicker in double buffer
    BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
    FillRectDMA2D(back_fb, 0, 0, 480, UI_HEADER_H, LCD_COLOR_BLUE);
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    BSP_LCD_SetBackColor(LCD_COLOR_BLUE);
    BSP_LCD_SetFont(&Font16);
    char buf[64]; 
    int freq_khz = SAMPLING_FREQ / 1000;
    
    // Calculate FPS
    static uint32_t frame_count = 0;
    static uint32_t last_fps_time = 0;
    static int current_fps = 0;
    
    frame_count++;
    if (HAL_GetTick() - last_fps_time >= 1000) {
        current_fps = frame_count;
        frame_count = 0;
        last_fps_time = HAL_GetTick();
        printf("[SYS] FPS:%d | CPU:%d%%\r\n", current_fps, current_cpu_load);
        
        // FSK DIAGNOSTICS
        if (g_ShowFSK) {
            float mMag = Filter_GetMag(&g_Modem.filterMark);
            float sMag = Filter_GetMag(&g_Modem.filterSpace);
            printf("[FSK DIAG] Baud:%d | Sig:%d%% | M:%d S:%d | SNR:%f | Carr:%d\r\n", 
                   (int)g_Modem.cfg.baudRate, 
                   (int)(g_MaxSignalLevel * 100.0f), 
                   (int)(mMag * 100.0f), (int)(sMag * 100.0f),
                   g_Modem.lastSNR, 
                   g_Modem.carrier);
             g_MaxSignalLevel = 0.0f; // Reset peak hold
        }
    }

    float dispL = (peakL / g_AudioGain) * 100.0f;
    float dispR = (peakR / g_AudioGain) * 100.0f;
    if (dispL > 100.0f) dispL = 100.0f;
    if (dispR > 100.0f) dispR = 100.0f;

    snprintf(buf, sizeof(buf), "DiscVU %dkHz / L:%03d%% R:%03d%% CPU:%d%% FPS:%d", 
             freq_khz, (int)dispL, (int)dispR, current_cpu_load, current_fps);
    BSP_LCD_DisplayStringAt(10, 7, (uint8_t*)buf, LEFT_MODE);

    // Final safety wait: ensure all DMA2D operations completed before returning
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    
    // 4. Draw VU Meter (Overlay at top-ish)
    if (g_ShowVUMeter) drawVU();

    // 5. Draw Buttons (Overlay at bottom)
    for(int i=0; i<buttonCount; i++) {
        Button* b = &buttons[i];
        uint32_t color = *b->toggleMode ? b->color : LCD_COLOR_DARKGRAY;
        FillRectDMA2D(back_fb, b->x, b->y, b->w, b->h, color);
        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        BSP_LCD_SetBackColor(color);
        BSP_LCD_SetFont(&Font12);
        BSP_LCD_DisplayStringAt(b->x + 5, b->y + 10, (uint8_t*)b->text, LEFT_MODE);
    }

    // 6. Commit Frame (VSync-Locked Flip)
    SCB_CleanDCache_by_Addr((uint32_t*)back_addr, 480 * 272 * 4);
    
