ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    // Ensure all DMA2D operations are finished
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    
    // 6. Handle Background Tasks (Main Thread Context)
    // Check for FSK lines offloaded from Modem Task
    if (g_LineReady) {
        Tape_ProcessLine(g_ReadyLineBuf);
        g_LineReady = false;
    }

    // 7. Flip Buffers (Hardware VSync)

    // Update hardware address and request Vertical Blanking Reload
    // Use NoReload variant to ensure Atomic switch at VSync
    HAL_LTDC_SetAddress_NoReload(&hLtdcHandler, back_addr, 0);
    HAL_LTDC_Reload(&hLtdcHandler, LTDC_SRCR_VBR); 
    
    // IMPORTANT: Wait for hardware to acknowledge the flip.
    // This prevents racing the scanline and eliminates all flickering.
    uint32_t reload_start = HAL_GetTick();
    while ((hLtdcHandler.Instance->SRCR & LTDC_SRCR_VBR) && (HAL_GetTick() - reload_start < 20)); 

    front_buffer_idx = back_idx;
}


static void drawSpectrum() {
    int bottomY = UI_VIZ_BOTTOM; int maxH = UI_VIZ_BOTTOM - UI_VIZ_TOP;
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;
    
    // WAIT for DMA2D background clear to finish before CPU starts drawing arrays over it
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    
    if (g_SpectrumMode == 1) {
        // --- 31/31 ISO Standard Stereo Split ---
        int barW = 7; 
        int totalW = 31 * barW;
        int leftX = (240 - totalW) / 2;
        int rightX = 240 + (240 - totalW) / 2;

        // Draw Divider
        for(int i=UI_VIZ_TOP; i<UI_VIZ_BOTTOM; i++) back_fb[i*480 + 240] = 0xFF555555;

        for(int i=0; i<31; i++) {
            // LEFT CHANNEL
            int hL = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTL, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            
            if (g_EnablePeakHold) {
                if ((float)hL >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)hL; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }
            FillRectCPU(back_fb, leftX + i*barW, bottomY - hL, barW-1, hL, COLOR_SPEC_L);
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (leftX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = COLOR_SPEC_L;
                }
            }

            // RIGHT CHANNEL
            int hR = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTR, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            int rIdx = 31 + i;
            if (g_EnablePeakHold) {
                if ((float)hR >= g_SpectrumPeaks[rIdx]) { g_SpectrumPeaks[rIdx] = (float)hR; g_PeakHoldCount[rIdx] = g_PeakHoldFrames; }
            }
            FillRectCPU(back_fb, rightX + i*barW, bottomY - hR, barW-1, hR, COLOR_SPEC_R);
             if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[rIdx];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (rightX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = COLOR_SPEC_R;
                }
            }
        }
    } else if (g_SpectrumMode == 2) {
        // --- 62-Band LED Mono Mode ---
        int barW = 7; 
        int totalW = 62 * barW;
        int startX = (480 - totalW) / 2;
        int segH = 4;
        int gap = 1;
        int totalSegH = segH + gap;
        
        for(int i=0; i<62; i++) {
            int h = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFT, i, maxH, g_SpectrumGain, g_ISO62_Map, 62);
            
            if (g_EnablePeakHold) {
                if ((float)h >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)h; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }

            // Draw LED Segments
            int numSegs = h / totalSegH;
            for (int s = 0; s < numSegs; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                
                FillRectCPU(back_fb, startX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }

            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                // Peak dot color matches the segment level
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[i]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;

                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (startX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }
        }
    } else if (g_SpectrumMode == 3) {
        // --- 31/31 ISO Standard Stereo Split LED Mode ---
        int barW = 7; 
        int totalW = 31 * barW;
        int leftX = (240 - totalW) / 2;
        int rightX = 240 + (240 - totalW) / 2;
        int segH = 4;
        int gap = 1;
        int totalSegH = segH + gap;

        // Draw Divider
        for(int i=UI_VIZ_TOP; i<UI_VIZ_BOTTOM; i++) back_fb[i*480 + 240] = 0xFF555555;

        for(int i=0; i<31; i++) {
            // LEFT CHANNEL LED
            int hL = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTL, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            if (g_EnablePeakHold) {
                if ((float)hL >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)hL; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }
            int numSegsL = hL / totalSegH;
            for (int s = 0; s < numSegsL; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                FillRectCPU(back_fb, leftX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[i]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (leftX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }

            // RIGHT CHANNEL LED
            int hR = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFTR, i, maxH, g_SpectrumGain, g_ISO31_Map, 31);
            int rIdx = 31 + i;
            if (g_EnablePeakHold) {
                if ((float)hR >= g_SpectrumPeaks[rIdx]) { g_SpectrumPeaks[rIdx] = (float)hR; g_PeakHoldCount[rIdx] = g_PeakHoldFrames; }
            }
            int numSegsR = hR / totalSegH;
            for (int s = 0; s < numSegsR; s++) {
                uint32_t segColor;
                float percent = (float)(s * totalSegH) / (float)maxH;
                if (percent < 0.6f) segColor = LCD_COLOR_GREEN;
                else if (percent < 0.85f) segColor = LCD_COLOR_YELLOW;
                else segColor = LCD_COLOR_RED;
                FillRectCPU(back_fb, rightX + i*barW, bottomY - (s+1)*totalSegH + gap, barW-1, segH, segColor);
            }
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[rIdx];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                uint32_t peakColor;
                float pPercent = (float)(g_SpectrumPeaks[rIdx]) / (float)maxH;
                if (pPercent < 0.6f) peakColor = LCD_COLOR_GREEN;
                else if (pPercent < 0.85f) peakColor = LCD_COLOR_YELLOW;
                else peakColor = LCD_COLOR_RED;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (rightX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = peakColor;
                }
            }
        }
    } else {
        // --- 62-Band ISO Standard Mono Mode ---
        int barW = 7; 
        int totalW = 62 * barW;
        int startX = (480 - totalW) / 2;
        
