ns96/STM32DiscVU/Core/Src/VisualizerApp.c
        for(int i=0; i<62; i++) {
            int h = (g_SimulationMode) ? (fft_mag_sim[i] * maxH) / 255 : getLogBarHeight(vRealFFT, i, maxH, g_SpectrumGain, g_ISO62_Map, 62);
            
            if (g_EnablePeakHold) {
                if ((float)h >= g_SpectrumPeaks[i]) { g_SpectrumPeaks[i] = (float)h; g_PeakHoldCount[i] = g_PeakHoldFrames; }
            }

            uint32_t barColor = heatARGB[i*4%256];
            FillRectCPU(back_fb, startX + i*barW, bottomY - h, barW-1, h, barColor);
            if (g_EnablePeakHold) {
                int peakY = bottomY - (int)g_SpectrumPeaks[i];
                if (peakY < UI_VIZ_TOP) peakY = UI_VIZ_TOP;
                for(int py=0; py<2; py++) {
                    uint32_t* row = &back_fb[(peakY + py) * 480 + (startX + i*barW)];
                    for(int px=0; px<(barW-1); px++) row[px] = barColor;
                }
            }
        }
    }
}

static void drawWaterfall() {
    int topY = UI_VIZ_TOP;
    int height = UI_VIZ_BOTTOM - UI_VIZ_TOP; // Exactly 200
    int width = WFALL_WIDTH; // 480
    uint32_t* wfall_fb = (uint32_t*)WFALL_FB_ADDRESS;

    // 1. Advance Circular Head
    g_WfallHead--;
    if (g_WfallHead < 0) g_WfallHead = height - 1;
    
    uint32_t* newRow = &wfall_fb[g_WfallHead * width];

    // 2. Fill new row with FFT data
    if (g_SimulationMode) {
        for(int x=0; x<width; x++) {
            int bin = (x * 64) / width;
            newRow[x] = wfall_lut[fft_mag_sim[bin % 64]];
        }
    } else {
        float aMax = 0.5f;
        for(int i=2; i<FFT_SIZE/2; i++) if(vRealFFT[i] > aMax) aMax = vRealFFT[i];

        for(int x=0; x<width; x++) {
            int bin = (x * (FFT_SIZE/2)) / width;
            if (bin < 2) bin = 2;
            float mag = vRealFFT[bin];
            int cIdx = (int)((mag * g_WaterfallGain / aMax) * 255.0f);
            if(cIdx > 255) cIdx = 255;
            newRow[x] = wfall_lut[cIdx];
        }
    }

    // Clean ONLY the new row in D-Cache
    SCB_CleanDCache_by_Addr((uint32_t*)newRow, width * 4);

    // 3. Draw Circular Buffer to Screen using DMA2D (Two chunks)
    uint32_t back_fb_addr = hLtdcHandler.LayerCfg[0].FBStartAdress;
    uint32_t* screen_ptr = (uint32_t*)(back_fb_addr + topY * 480 * 4);
    
    // Part A: From Head to Bottom of buffer
    int rowsA = height - g_WfallHead;
    CopyBlockDMA2D(&wfall_fb[g_WfallHead * width], screen_ptr, width, rowsA);
    
    // Part B: Wrap around from top of buffer to (Head - 1)
    if (g_WfallHead > 0) {
        int rowsB = g_WfallHead;
        CopyBlockDMA2D(wfall_fb, &screen_ptr[rowsA * width], width, rowsB);
    }
}

static void drawPCMF1() {
    int startY = UI_VIZ_TOP;
    int height = UI_VIZ_BOTTOM - UI_VIZ_TOP; // 200 lines
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;
    
    // PCM-F1 Constants
    const int BIT_WIDTH = 3;
    const int BITS_PER_LINE = 137;
    const int TOTAL_WIDTH = BITS_PER_LINE * BIT_WIDTH; // 411
    const int X_OFFSET = (480 - TOTAL_WIDTH) / 2;
    
    // Each line needs 6 mono samples (3 stereo frames).
    // 200 lines * 3 frames = 600 stereo frames (1200 mono samples).
    int ringReadIdx = (g_PCMF1_RingIdx - 600 + PCMF1_RING_SIZE) % PCMF1_RING_SIZE;
    int monoReadIdx = 0;
    
    uint8_t bits[137];
    
    for (int y = 0; y < height; y++) {
        uint32_t *dest_row = back_fb + ((startY + y) * 480);
        
        memset(bits, 0, sizeof(bits));
        // Sync pattern: 0 1 0 1
        bits[0]=0; bits[1]=1; bits[2]=0; bits[3]=1; 
        // Control: 1 1 1 1 0
        bits[132]=1; bits[133]=1; bits[134]=1; bits[135]=1; bits[136]=0;

        uint16_t w[6], q_bits[6];
        for(int i = 0; i < 6; i++) {
            int16_t samp;
            if (monoReadIdx % 2 == 0) {
                samp = g_PCMF1_RingL[ringReadIdx];
            } else {
                samp = g_PCMF1_RingR[ringReadIdx];
                ringReadIdx = (ringReadIdx + 1) % PCMF1_RING_SIZE;
            }
            w[i] = (samp >> 2) & 0x3FFF; // 14-bit
            q_bits[i] = samp & 0x03;      // 2-bit
            monoReadIdx++;
        }
        
        uint16_t p = w[0]^w[1]^w[2]^w[3]^w[4]^w[5];
        // Q parity calculation (LSbs interleaved)
        uint16_t q = (q_bits[0] << 12) | (q_bits[1] << 10) | (q_bits[2] << 8) |
                    (q_bits[3] << 6)  | (q_bits[4] << 4)  | (q_bits[5] << 2);
        
        // Interleave logic (history of 128 lines)
        int hist_idx = global_enc_line % 128;
        for(int i=0; i<6; i++) enc_hist_w[hist_idx][i] = w[i];
        enc_hist_p[hist_idx] = p;
        enc_hist_q[hist_idx] = q;

        // Pack interleaved words
        uint16_t words_to_pack[7];
        words_to_pack[0] = enc_hist_w[(global_enc_line - 0   + 128) % 128][0];
        words_to_pack[1] = enc_hist_w[(global_enc_line - 16  + 128) % 128][1];
        words_to_pack[2] = enc_hist_w[(global_enc_line - 32  + 128) % 128][2];
        words_to_pack[3] = enc_hist_w[(global_enc_line - 48  + 128) % 128][3];
        words_to_pack[4] = enc_hist_w[(global_enc_line - 64  + 128) % 128][4];
        words_to_pack[5] = enc_hist_w[(global_enc_line - 80  + 128) % 128][5];
        words_to_pack[6] = enc_hist_p[(global_enc_line - 96  + 128) % 128];
        // words_to_pack[7] = enc_hist_q[(global_enc_line - 112 + 128) % 128]; // Q is at bits 118+

        for (int w_idx=0; w_idx<7; w_idx++) {
            for(int b=0; b<14; b++) {
                bits[4+(w_idx*14)+b] = ((words_to_pack[w_idx]>>(13-b))&1);
            }
        }

        uint16_t crc = crc16_ccitt(bits, 4, 98);
        for (int b=0; b<16; b++) bits[102+b] = ((crc>>(15-b))&1);
        
        // Final bits (Q area)
        uint16_t line_q = enc_hist_q[(global_enc_line - 112 + 128) % 128];
        for (int b=0; b<14; b++) bits[118+b] = ((line_q>>(13-b))&1);

        global_enc_line++;

        // Draw bits
        for (int b=0; b<BITS_PER_LINE; b++) {
            uint32_t color = bits[b] ? LCD_COLOR_WHITE : LCD_COLOR_BLACK;
            for (int px=0; px<BIT_WIDTH; px++) {
                dest_row[X_OFFSET + (b*BIT_WIDTH) + px] = color;
            }
        }
    }
}

static void drawVU() {
    int w = g_ShowFSKEncode ? 200 : 400; 
    int h = 12; int x = 40;
    int yL = UI_HEADER_H + 5; int yR = UI_HEADER_H + 20;

    // Logarithmic (dB) Scaling for "Sensitive" Meters
    // Range: -70dB to +3dB (Headroom for FSK pinning)
    // Using log10f(rms + offset) for stability. 0dB = 1.0f (Target)
    float dbL = 20.0f * log10f((peakL * g_VUGain) / g_AudioGain + 0.000001f);
    float dbR = 20.0f * log10f((peakR * g_VUGain) / g_AudioGain + 0.000001f);
    
    // Calibration: map -60dB -> 0%, 0dB -> 90%, +6dB -> 100%
    // This ensures headroom and prevents pinning.
    const float minDb = -60.0f;
    const float maxDb = 6.0f;
    
    float normL = (dbL - minDb) / (maxDb - minDb);
    if (normL < 0) normL = 0.0f; 
    if (normL > 1.0f) normL = 1.0f;
    float normR = (dbR - minDb) / (maxDb - minDb);
    if (normR < 0) normR = 0.0f; 
    if (normR > 1.0f) normR = 1.0f;

    int lL = (int)(normL * w);
    int rL = (int)(normR * w);
    
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;

