ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    if (g_EnablePeakHold) {
        // Attack Logic: Keep instant response in draw loop
        if ((float)lL >= g_VUPeaks[0]) {
            g_VUPeaks[0] = (float)lL;
            g_VUPeakHoldCount[0] = g_PeakHoldFrames; 
        }
        
        if ((float)rL >= g_VUPeaks[1]) {
            g_VUPeaks[1] = (float)rL;
            g_VUPeakHoldCount[1] = g_PeakHoldFrames;
        }
    }

    // Draw L Channel (Green)
    if(lL > 0) FillRectDMA2D(back_fb, x, yL, lL, h, LCD_COLOR_GREEN);
    // Draw L Peak (Green, 4px wide, CPU)
    if(g_EnablePeakHold && g_VUPeaks[0] > 0) {
        int pxBase = x + (int)g_VUPeaks[0];
        for(int py=0; py<h; py++) {
            uint32_t* row = &back_fb[(yL + py) * 480 + pxBase];
            for(int px=0; px<4; px++) row[px] = LCD_COLOR_GREEN;
        }
    }

    // Draw R Channel (Red)
    if(rL > 0) FillRectDMA2D(back_fb, x, yR, rL, h, LCD_COLOR_RED);
    // Draw R Peak (Red, 4px wide, CPU)
    if(g_EnablePeakHold && g_VUPeaks[1] > 0) {
        int pxBase = x + (int)g_VUPeaks[1];
        for(int py=0; py<h; py++) {
            uint32_t* row = &back_fb[(yR + py) * 480 + pxBase];
            for(int px=0; px<4; px++) row[px] = LCD_COLOR_RED;
        }
    }
}

// --- FSK Buffering State Reset ---
// This ensures that when encoding starts, we immediately buffer Sec 0
static uint32_t g_lastGenSec = 0xFFFFFFFF;
static int g_repeatCount = 0;
void FSK_Reset_Buffering_State(void) {
    g_lastGenSec = 0xFFFFFFFF;
    g_repeatCount = 0;
    // Also clear the FIFO to prevent stale audio from previous runs
    g_FSK_FIFO_ReadIdx = 0;
    g_FSK_FIFO_WriteIdx = 0;
}

static void UpdateFSKEncode(void) {
    if (!g_IsEncoding) return;
    
    // Auto-Stop Check
    if (g_EncodeSeconds >= g_EncodeDuration * 60) {
        g_IsEncoding = false;
        addFSKDisplayString("\n### ENCODING COMPLETE\n");
        return;
    }

    // Update real-time clock for UI display
    uint32_t now = HAL_GetTick();
    if (now - g_LastEncodeTick >= 1000) {
        g_LastEncodeTick = now;
        g_EncodeSeconds++;
    }

    // FIFO Management: Buffer ahead
    uint32_t used = (g_FSK_FIFO_WriteIdx >= g_FSK_FIFO_ReadIdx) ? 
                    (g_FSK_FIFO_WriteIdx - g_FSK_FIFO_ReadIdx) :
                    (FSK_FIFO_SIZE - (g_FSK_FIFO_ReadIdx - g_FSK_FIFO_WriteIdx));
    
    // Fill the buffer when we have at least 66000 empty spots in the FIFO
    // A 1-second block at 300 baud is roughly 49600 samples.
    if (used <= (FSK_FIFO_SIZE - 66000)) {
        uint32_t secToGen;
        if (g_lastGenSec == 0xFFFFFFFF) {
            secToGen = 0;
            g_repeatCount = 1;
        } else {
            if (g_repeatCount < 4) {
                secToGen = g_lastGenSec;
                g_repeatCount++;
            } else {
                secToGen = g_lastGenSec + 1;
                g_repeatCount = 1;
            }
        }
        
        if (secToGen < g_EncodeDuration * 60) {
            g_lastGenSec = secToGen;
            
            char dctBuf[48];
            snprintf(dctBuf, sizeof(dctBuf), "DCT0%c_01_aaaaaaaaaa_%04d_%04d\n", g_EncodeSide, (int)secToGen, (int)secToGen);
            addFSKDisplayString(dctBuf);
            
            // 65536 is absolutely required to prevent buffer truncation at 300 baud!
            // Map the colossal 131KB temporary block generator to unused external SDRAM at 0xC0380000
            int16_t* txBuf = (int16_t*)0xC0380000; 
            size_t samplesGenerated = FSK_Modem_GenerateTX(&g_TxModem, dctBuf, txBuf, 65536);
            if (samplesGenerated > 0) {
                for(size_t i=0; i<samplesGenerated; i++) {
                    FSK_FIFO_Push(txBuf[i]);
                }
                printf("FSK: Buffered %d samples for Sec %d\n", (int)samplesGenerated, (int)secToGen);
            }
        }
    }
}

static void drawFSKText(void) {
    BSP_LCD_SetTextColor(LCD_COLOR_DARKGREEN);
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
    BSP_LCD_SetFont(&Font12);
    // WAIT for any previous DMA2D operations to finish before CPU writes text
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    BSP_LCD_SetTextColor(LCD_COLOR_GREEN); // Use bright green for high visibility
    BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
    BSP_LCD_SetFont(&Font12);
    
    int startY = UI_VIZ_TOP + 40;
    int endY = UI_VIZ_BOTTOM;
    int lineHeight = 12;
    
    // Split screen logic: FSK Log on left (0-240), Stats on right (240-480)
    int wrapCount = 34; // Adjusted for Font12 (7px wide, 240/7 = 34)

    // Draw Vertical Separator
    uint32_t* back_fb = (uint32_t*)hLtdcHandler.LayerCfg[0].FBStartAdress;
    for(int i=startY; i<endY; i++) back_fb[i*480 + splitX] = 0xFF555555;

    // --- Left Side: FSK Log ---
    static int logicalLineStarts[128]; // Stack safety (static)
    int logicalLineCount = 0;
    int currentLineLen = 0;

    vTaskSuspendAll();
    int textLen = g_FSKTextLen;
    // Snapshot the text for rendering so we can release the scheduler early
    static char textSnap[2048];
    memcpy(textSnap, g_FSKText, textLen);
    xTaskResumeAll();

    logicalLineStarts[0] = 0;
    logicalLineCount = 1;

    for (int i = 0; i < textLen; i++) {
        char c = textSnap[i];
        currentLineLen++;
        if (c == '\n' || currentLineLen >= wrapCount) {
            if (logicalLineCount < 128) logicalLineStarts[logicalLineCount++] = i + 1;
            currentLineLen = 0;
        }
    }
    if (logicalLineCount > 0 && logicalLineStarts[logicalLineCount-1] >= textLen && textLen > 0) logicalLineCount--;

    int y = startY;
    BSP_LCD_SetFont(&Font12);
    
    // 1. Draw Static Header (Current Mapped Track)
    if (g_CurrentMappedRecord[0] != '\0') {
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW); // Highlights the mapped record
        BSP_LCD_DisplayStringAt(10, y, (uint8_t*)g_CurrentMappedRecord, LEFT_MODE);
        y += lineHeight;
        // Draw a small separator line
        FillRectDMA2D(back_fb, 10, y + 2, splitX - 20, 1, 0xFF555555);
        y += 6;
    }
    
    // 2. Draw Scrolling FSK Log
    BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
    int availableHeight = endY - y;
    int scrollLinesToShow = availableHeight / lineHeight;
    if (scrollLinesToShow > 11) scrollLinesToShow = 11; // Safety limit
    
    int linesToShow = (logicalLineCount > scrollLinesToShow) ? scrollLinesToShow : logicalLineCount;
    int startLineIdx = logicalLineCount - linesToShow;
    
