ns96/STM32DiscVU/Core/Src/VisualizerApp.c
    for (int l = 0; l < linesToShow; l++) {
        int charStart = logicalLineStarts[startLineIdx + l];
        int charEnd = (startLineIdx + l + 1 < logicalLineCount) ? logicalLineStarts[startLineIdx + l + 1] : textLen;
        int len = charEnd - charStart;
        if (len <= 0) continue;
        
        char lineBuf[64];
        if (len > 60) len = 60;
        memcpy(lineBuf, &textSnap[charStart], len);
        lineBuf[len] = '\0';
        
        // Clean line endings
        for(int k=0; k<len; k++) if(lineBuf[k] == '\r' || lineBuf[k] == '\n') lineBuf[k] = '\0';

        if (lineBuf[0] != '\0') {
            BSP_LCD_DisplayStringAt(10, y, (uint8_t*)lineBuf, LEFT_MODE);
        }
        y += lineHeight;
    }

    // --- Right Side: TapeStats or FSK Encode Panel ---
    BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
    y = startY;
    int statsX = splitX + 10;
    
    if (g_ShowFSKEncode) {
        // --- FSK Encode Panel (Optimized Layout) ---
        y = UI_VIZ_TOP + 5; // Start earlier to save space
        
        // Row 1: Baud Rate [ < ] [ BAUD ] [ > ]
        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        BSP_LCD_DisplayStringAt(statsX, y + 8, (uint8_t*)"Baud:", LEFT_MODE);
        
        int bx = statsX + 45;
        // Left Arrow
        BSP_LCD_DrawRect(bx, y, 58, 30);
        BSP_LCD_DisplayStringAt(bx + (58 - 7)/2, y + 8, (uint8_t*)"<", LEFT_MODE); bx += 63;
        // Baud Value (Center)
        BSP_LCD_DrawRect(bx, y, 58, 30);
        char bBuf[16]; snprintf(bBuf, sizeof(bBuf), "%d", (int)g_BaudRate);
        BSP_LCD_DisplayStringAt(bx + (58 - strlen(bBuf)*7)/2, y + 8, (uint8_t*)bBuf, LEFT_MODE); bx += 63;
        // Right Arrow
        BSP_LCD_DrawRect(bx, y, 58, 30);
        BSP_LCD_DisplayStringAt(bx + (58 - 7)/2, y + 8, (uint8_t*)">", LEFT_MODE);
        y += 40;
        
        // Row 2: Side Selection [SIDE A] [SIDE B]
        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        BSP_LCD_DisplayStringAt(statsX, y + 8, (uint8_t*)"Side:", LEFT_MODE);
        bx = statsX + 45;
        // Side A
        BSP_LCD_SetTextColor(g_EncodeSide == 'A' ? LCD_COLOR_GREEN : 0xFF555555);
        BSP_LCD_DrawRect(bx, y, 58, 30);
        BSP_LCD_DisplayStringAt(bx + 11, y + 8, (uint8_t*)"A", LEFT_MODE); bx += 63;
        // Side B
        BSP_LCD_SetTextColor(g_EncodeSide == 'B' ? LCD_COLOR_GREEN : 0xFF555555);
        BSP_LCD_DrawRect(bx, y, 58, 30);
        BSP_LCD_DisplayStringAt(bx + 11, y + 8, (uint8_t*)"B", LEFT_MODE);
        
        y += 40;
        
        // Duration Buttons
        int durations[] = {45, 90, 120, 240};
        const char* dLabels[] = {"45M", "90M", "120M", "240M"};
        bx = statsX;
        for(int i=0; i<4; i++) {
            bool active = g_IsEncoding && g_EncodeDuration == durations[i];
            BSP_LCD_SetTextColor(active ? LCD_COLOR_YELLOW : (g_IsEncoding ? 0xFF555555 : LCD_COLOR_WHITE));
            BSP_LCD_DrawRect(bx, y, 50, 30);
            BSP_LCD_DisplayStringAt(bx + (50 - strlen(dLabels[i])*7)/2, y + 8, (uint8_t*)dLabels[i], LEFT_MODE);
            bx += 58;
        }
        y += 40;
        
        if (g_IsEncoding) {
            BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
            char pBuf[32];
            int mins = g_EncodeSeconds / 60;
            int secs = g_EncodeSeconds % 60;
            snprintf(pBuf, sizeof(pBuf), "PROG: %02d:%02d / %d:00", mins, secs, g_EncodeDuration);
            BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)pBuf, LEFT_MODE);
            y += 15;
            BSP_LCD_SetTextColor(LCD_COLOR_RED);
            BSP_LCD_DrawRect(statsX, y, 190, 25);
            BSP_LCD_DisplayStringAt(statsX + 40, y + 5, (uint8_t*)"STOP ENCODING", LEFT_MODE);
        }

    } else {
        // --- Original TapeStats ---
        char sBuf[64];
        
        int snrInt = (int)g_Modem.lastSNR;
        int snrDec = (int)((g_Modem.lastSNR - snrInt) * 100);
        if(snrDec < 0) snrDec = -snrDec;
        
        // Speed Offset Calculation
        float speedOffset = 0;
        if (g_Modem.lastMeasuredBaud > 0) {
            speedOffset = (g_Modem.lastMeasuredBaud - g_BaudRate) * 100.0f / g_BaudRate;
        }
        int offInt = (int)speedOffset;
        int offDec = (int)((speedOffset - offInt) * 10);
        if(offDec < 0) offDec = -offDec;
        if(offInt < 0) offInt = -offInt;
        char sign = (speedOffset >= 0) ? '+' : '-';

        snprintf(sBuf, sizeof(sBuf), "Baud: %d (%c%d.%d%%) | SNR: %d.%02d", 
                 (int)g_Modem.lastMeasuredBaud, sign, (int)offInt, (int)offDec, (int)snrInt, (int)snrDec);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

        snprintf(sBuf, sizeof(sBuf), "Side: %c | Stops: %d", g_TapeStats.currentSide, g_TapeStats.totalStops);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

        snprintf(sBuf, sizeof(sBuf), "Mode: %s", g_TapeStats.isDctMode ? "DCT" : "Generic");
        BSP_LCD_SetTextColor(g_TapeStats.isDctMode ? LCD_COLOR_CYAN : LCD_COLOR_MAGENTA);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;

        BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
        int h = g_TapeStats.lastTotalTime / 3600;
        int m = (g_TapeStats.lastTotalTime % 3600) / 60;
        int s = g_TapeStats.lastTotalTime % 60;
        snprintf(sBuf, sizeof(sBuf), "Total: %d (%02d:%02d:%02d)", g_TapeStats.logLineCount, h, m, s);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;
        
        snprintf(sBuf, sizeof(sBuf), "Errors: %d", g_TapeStats.dataErrors);
        BSP_LCD_SetTextColor(g_TapeStats.dataErrors > 0 ? LCD_COLOR_RED : LCD_COLOR_GREEN);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;
        
        BSP_LCD_SetTextColor(LCD_COLOR_YELLOW);
        float sideAPerc = (g_TapeStats.sideALineCount > 0) ? ((float)g_TapeStats.sideAErrors * 100.0f / (float)g_TapeStats.sideALineCount) : 0.0f;
        int saInt = (int)sideAPerc; int saDec = (int)((sideAPerc - saInt) * 100); if(saDec < 0) saDec = -saDec;
        snprintf(sBuf, sizeof(sBuf), "Side A: %d/%d (%d.%02d%%)", g_TapeStats.sideAErrors, g_TapeStats.sideALineCount, saInt, saDec);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight;

