ns96/STM32DiscVU/Core/Src/VisualizerApp.c
        float sideBPerc = (g_TapeStats.sideBLineCount > 0) ? ((float)g_TapeStats.sideBErrors * 100.0f / (float)g_TapeStats.sideBLineCount) : 0.0f;
        int sbInt = (int)sideBPerc; int sbDec = (int)((sideBPerc - sbInt) * 100); if(sbDec < 0) sbDec = -sbDec;
        snprintf(sBuf, sizeof(sBuf), "Side B: %d/%d (%d.%02d%%)", g_TapeStats.sideBErrors, g_TapeStats.sideBLineCount, sbInt, sbDec);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE); y += lineHeight + 4;

        BSP_LCD_SetTextColor(LCD_COLOR_CYAN);
        snprintf(sBuf, sizeof(sBuf), "Format Err: L=%d N=%d", g_TapeStats.dataLengthErrors, g_TapeStats.dataErrors);
        BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)sBuf, LEFT_MODE);
        y += lineHeight;

        // --- Metadata HUD ---
        if (g_HasMetadata) {
            y += 4; 
            BSP_LCD_SetTextColor(LCD_COLOR_ORANGE);
            
            char* filename = strrchr(g_CurrentTrack.sourcePath, '/');
            if (!filename) filename = strrchr(g_CurrentTrack.sourcePath, '\\');
            if (filename) filename++; else filename = g_CurrentTrack.sourcePath;

            char displayBuf[160];
            snprintf(displayBuf, sizeof(displayBuf), "FILE: %s", filename);

            int remain = strlen(displayBuf);
            char* ptr = displayBuf;
            while (remain > 0 && y < 272 - lineHeight) {
                char chunk[32];
                int take = (remain > 22) ? 22 : remain; // Harder wrap for right side
                strncpy(chunk, ptr, take);
                chunk[take] = '\0';
                BSP_LCD_DisplayStringAt(statsX, y, (uint8_t*)chunk, LEFT_MODE);
                y += lineHeight; ptr += take; remain -= take;
        }
    }
    
    // No more global resume here, it's handled inside the logical blocks
    }
}

static void initButtons() {
    buttonCount = 0; int bY = 230, bW = 58, bG = 8;
    // Buttons 0-4
    buttons[buttonCount++] = (Button){10, bY, bW, 30, "SPEC", toggleSpectrum, LCD_COLOR_BLUE, &g_ShowSpectrum};
    buttons[buttonCount++] = (Button){10+(bW+bG), bY, bW, 30, "VU", toggleVU, LCD_COLOR_BLUE, &g_ShowVUMeter};
    buttons[buttonCount++] = (Button){10+(bW+bG)*2, bY, bW, 30, vu_gain_texts[vu_gain_idx], cycleVUGain, LCD_COLOR_MAGENTA, &g_GainAlwaysActive};
    buttons[buttonCount++] = (Button){10+(bW+bG)*3, bY, bW, 30, "WFALL", toggleWaterfall, LCD_COLOR_BLUE, &g_ShowWaterfall};
    buttons[buttonCount++] = (Button){10+(bW+bG)*4, bY, bW, 30, "FSK", toggleFSK, LCD_COLOR_YELLOW, &g_ShowFSK};
    
    // FSKe replacement for SIM when FSK is active
    if (g_ShowFSK) {
        const char* fskLabel = "FSKenc";
        buttons[buttonCount++] = (Button){10+(bW+bG)*5, bY, bW, 30, fskLabel, toggleSim, LCD_COLOR_BROWN, &g_ShowFSKEncode};
    } else {
        buttons[buttonCount++] = (Button){10+(bW+bG)*5, bY, bW, 30, "SIM", toggleSim, LCD_COLOR_BROWN, &g_SimulationMode};
    }
    
    // Button 6
    buttons[buttonCount++] = (Button){10+(bW+bG)*6, bY, bW, 30, "IN:MIC", toggleInput, LCD_COLOR_CYAN, &g_InputLineIn};
}

static void handleTouch() {
    TS_StateTypeDef ts; if(!ts_enabled) return;
    BSP_TS_GetState(&ts);
    if(ts.touchDetected) {
        static uint32_t lastT = 0; if(HAL_GetTick() - lastT < 200) return;
        lastT = HAL_GetTick();
        
        // 1. Header Zone (Top 30px) - Toggle Aesthetics
        if (ts.touchY[0] < UI_VIZ_TOP) {
            g_EnableAesthetics = !g_EnableAesthetics;
            return;
        }
        
        // 2. Visualizer Zone (Middle)
        if (ts.touchY[0] >= UI_VIZ_TOP && ts.touchY[0] < UI_VIZ_BOTTOM) {
            int zone = ts.touchX[0] / 160;
            if (zone == 0) { // Left third
                if (g_ShowFSK) {
                    vTaskSuspendAll();
                    memset(g_FSKText, 0, sizeof(g_FSKText));
                    g_FSKTextLen = 0;
                    memset(&g_TapeStats, 0, sizeof(g_TapeStats));
                    g_TapeStats.currentSide = 'A';
                    g_CurrentLineIdx = 0;
                    xTaskResumeAll();
                } else if (g_ShowSpectrum) {
                    g_SpectrumMode = (g_SpectrumMode + 1) % 4;
                }
            } else if (zone == 1 && !g_ShowFSKEncode) { // Middle third: Toggle Peak Hold (DISABLED if FSKe panel is open)
                g_EnablePeakHold = !g_EnablePeakHold;
                if (g_EnablePeakHold) {
                    memset(g_SpectrumPeaks, 0, sizeof(g_SpectrumPeaks));
                    memset(g_VUPeaks, 0, sizeof(g_VUPeaks));
                }
            } else if (zone == 2 || (zone == 1 && g_ShowFSKEncode)) { // Right + Overlap: FSK Encode Panel Interactions
                if (g_ShowWaterfall) {
                    g_ShowPCMF1 = !g_ShowPCMF1;
                    return;
                }
                if (g_ShowFSK) {
                    if (g_ShowFSKEncode) {
                        int statsX = splitX + 10;
                        int tx = ts.touchX[0];
                        int ty = ts.touchY[0];
                        int ry = ty - (UI_VIZ_TOP + 5); // Relative Y from Panel Start
                        
                        // 1. Baud Rate [ < ] BAUD [ > ] (ry ~ 0-30)
                        if (ry >= 0 && ry <= 30) {
                            if (tx >= statsX + 45 && tx <= statsX + 45 + 58) { // Left arrow
                                g_BaudIdx = (g_BaudIdx + 2) % 3;
                            } else if (tx >= statsX + 45 + 126 && tx <= statsX + 45 + 126 + 58) { // Right arrow
                                g_BaudIdx = (g_BaudIdx + 1) % 3;
                            }
                            g_BaudRate = g_BaudRates[g_BaudIdx];
                            initFSKModems(); // Sync both RX and TX
                        }
                        // 2. Side Selection [SIDE A] [SIDE B] (ry ~ 40-70)
                        else if (ry >= 40 && ry <= 70) {
                            if (tx >= statsX + 45 && tx <= statsX + 45 + 58) g_EncodeSide = 'A';
                            else if (tx >= statsX + 45 + 63 && tx <= statsX + 45 + 63 + 58) g_EncodeSide = 'B';
                        }
                        // 3. Durations (ry ~ 80-150)
                        else if (ry >= 80 && ry <= 150) {
                            int dx = tx - statsX;
                            if (dx >= 0 && dx < 224) {
                                if (g_IsEncoding) {
                                    if (ry >= 115) { // STOP button area (y += 40 from 80 = 120)
                                        g_IsEncoding = false;
                                        addFSKDisplayString("\n### ENCODING STOPPED\n");
                                    }
                                } else {
                                    if (dx < 54) g_EncodeDuration = 45;
                                    else if (dx < 112) g_EncodeDuration = 90;
                                    else if (dx < 170) g_EncodeDuration = 120;
                                    else g_EncodeDuration = 240;
                                    
                                    g_IsEncoding = true;
                                    g_SimulationMode = false; // Disable sim for live view
                                    g_EncodeSeconds = 0;
                                    g_LastEncodeTick = HAL_GetTick();
                                    
                                    // Force Audio Output State
                                    BSP_AUDIO_OUT_SetVolume(100);
                                    BSP_AUDIO_OUT_SetMute(AUDIO_MUTE_OFF);
                                    
                                    // Trigger immediate buffering of Sec 0
                                    extern void FSK_Reset_Buffering_State(void);
                                    FSK_Reset_Buffering_State();
                                    
                                    // Reset RX modem state to prevent stale carrier logs
                                    FSK_Modem_Init(&g_Modem, g_Modem.cfg); 
                                    
                                    char msg[64];
                                    snprintf(msg, sizeof(msg), "\n### STARTING %d MIN DCT (SIDE %c)\n", g_EncodeDuration, g_EncodeSide);
                                    addFSKDisplayString(msg);
                                }
                            }
                        }
                    } else {
                        cycleBaudRate();
                    }
                }
            }
            return;
        }

        // 2. Check Buttons
        for(int i = 0; i < buttonCount; i++) {
            Button* b = &buttons[i];
            if(ts.touchX[0] >= b->x && ts.touchX[0] <= b->x + b->w && ts.touchY[0] >= b->y && ts.touchY[0] <= b->y + b->h) {
                if(b->onClick) b->onClick(); 
                break;
            }
        }
    }
}

static void toggleWaterfall() { g_ShowWaterfall = !g_ShowWaterfall; if(g_ShowWaterfall) { g_ShowSpectrum = false; g_ShowPCMF1 = false; if(g_ShowFSK) { g_ShowFSK = false; g_ShowFSKEncode = false; } } initButtons(); }
static void toggleSpectrum() { g_ShowSpectrum = !g_ShowSpectrum; if(g_ShowSpectrum) { g_ShowWaterfall = false; if(g_ShowFSK) { g_ShowFSK = false; g_ShowFSKEncode = false; } } initButtons(); }
static void toggleVU() { g_ShowVUMeter = !g_ShowVUMeter; }
static void toggleSim() { 
    if (g_ShowFSK) {
        g_ShowFSKEncode = !g_ShowFSKEncode;
    } else {
        g_SimulationMode = !g_SimulationMode; 
        fftIdx = 0; 
    }
    initButtons();
}

static void toggleFSK() {
    g_ShowFSK = !g_ShowFSK;
    if (g_ShowFSK) {
        g_ShowWaterfall = false;
        g_ShowSpectrum = false;
        // Reset text for fresh start
        memset(g_FSKText, 0, sizeof(g_FSKText));
        g_FSKTextLen = 0;
        memset(&g_TapeStats, 0, sizeof(g_TapeStats));
        g_TapeStats.currentSide = 'A';
        g_CurrentLineIdx = 0;
        initFSKModems();
        FSK_FIFO_Reset();
    } else {
        g_ShowFSKEncode = false; // Hide panel when FSK is off
        g_IsEncoding = false;    // Stop any active encoding
    }
    initButtons(); // Refresh button labels (SIM -> FSKe)
}

extern int16_t playback_buffer[AUDIO_BUFFER_SIZE];

static void Visualizer_InitAudio() {
    static bool first_init = true;
    if (!first_init) {
        BSP_AUDIO_IN_Stop(CODEC_PDWN_SW);
        BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
    }
    first_init = false;
    
    uint16_t dev = g_InputLineIn ? INPUT_DEVICE_INPUT_LINE_1 : INPUT_DEVICE_DIGITAL_MICROPHONE_2;
    
    printf("[AUDIO] Calling BSP_AUDIO_IN_OUT_Init...\r\n");
    if (BSP_AUDIO_IN_OUT_Init(dev, OUTPUT_DEVICE_HEADPHONE, SAMPLING_FREQ, 16, 2) == AUDIO_OK) {
        printf("[AUDIO] Init OK. Starting streams...\r\n");
        
        memset(playback_buffer, 0, sizeof(playback_buffer));
        BSP_AUDIO_OUT_SetOutputMode(OUTPUT_DEVICE_HEADPHONE);
        BSP_AUDIO_OUT_SetVolume(90);
        BSP_AUDIO_OUT_SetMute(AUDIO_MUTE_OFF);
        // BSP_AUDIO_OUT_Play size is in BYTES.
        BSP_AUDIO_OUT_Play((uint16_t*)playback_buffer, AUDIO_BUFFER_SIZE * 2);
        
        BSP_AUDIO_IN_Record((uint16_t*)audio_buffer, AUDIO_BUFFER_SIZE);
        g_AudioGain = g_InputLineIn ? g_LineInGain : g_MicGain;
    } else {
        printf("[AUDIO] Init FAILED!\r\n");
    }
}

static void toggleInput() {
    g_InputLineIn = !g_InputLineIn;
    Visualizer_InitAudio();
    buttons[6].text = g_InputLineIn ? "IN:LINE" : "IN:MIC";
}

static void cycleVUGain() {
    vu_gain_idx = (vu_gain_idx + 1) % 5;
    g_VUGain = vu_gain_vals[vu_gain_idx];
    buttons[2].text = vu_gain_texts[vu_gain_idx];
}
static uint32_t Color565ToARGB(uint16_t rgb565) {
    uint32_t r = (rgb565 >> 11) & 0x1F; uint32_t g = (rgb565 >> 5) & 0x3F; uint32_t b = rgb565 & 0x1F;
    return 0xFF000000 | (((r*255)/31) << 16) | (((g*255)/63) << 8) | ((b*255)/31);
}
static void initFSKModems(void) {
    if (g_BaudRate < 300.0f) g_BaudRate = 1200.0f; // Safety
    
    // Standard PC decoders (like minimodem) expect specific Bell standards for different speeds!
    if (g_BaudRate == 300.0f) {
        // Bell 103 (300 baud standard)
        g_Modem.cfg.freqMark = 1270.0f;
        g_Modem.cfg.freqSpace = 1070.0f;
    } else {
        // Bell 202 (1200 baud standard)
        g_Modem.cfg.freqMark = 1200.0f;
        g_Modem.cfg.freqSpace = 2200.0f;
    }
    g_Modem.cfg.baudRate = g_BaudRate;
    g_Modem.cfg.sampleRate = 12000.0f;
    g_Modem.cfg.noiseFloor = 0.2f;
    g_Modem.cfg.invert = false;
    FSK_Modem_Init(&g_Modem, g_Modem.cfg);
    
    FSK_Config txCfg = g_Modem.cfg;
    txCfg.sampleRate = 48000.0f;
    FSK_Modem_Init(&g_TxModem, txCfg);
    
    printf("FSK: Modems Init to %d baud (RX=12k, TX=48k)\r\n", (int)g_BaudRate);
}

static void cycleBaudRate(void) {
    g_BaudIdx = (g_BaudIdx + 1) % 3; // Fixed: 3 entries, not 5
    g_BaudRate = g_BaudRates[g_BaudIdx];
    initFSKModems();
    
    // Clear text area and print new baud
    g_FSKTextLen = 0;
    g_FSKText[0] = '\0';
    
    char msg[32];
    snprintf(msg, sizeof(msg), "[BAUD: %d]\n", (int)g_BaudRate);
    addFSKDisplayString(msg);
}

static void FillRectDMA2D(uint32_t* fb, int x, int y, int w, int h, uint32_t color) {
    if (x < 0) { w += x; x = 0; }
    if (y < 0) { h += y; y = 0; }
    if (x + w > 480) w = 480 - x;
    if (y + h > 272) h = 272 - y;
    if (w <= 0 || h <= 0) return;

    // WAIT for previous operation at the START
    while (hdma2d.Instance->CR & DMA2D_CR_START);

    hdma2d.Instance->OPFCCR = DMA2D_OUTPUT_ARGB8888;
    hdma2d.Instance->OOR = 480 - w;
    hdma2d.Instance->OMAR = (uint32_t)&fb[y * 480 + x];
    hdma2d.Instance->NLR = (w << 16) | h;
    hdma2d.Instance->OCOLR = color;
    
    // Start Register-to-Memory fill
    hdma2d.Instance->CR = DMA2D_R2M | DMA2D_CR_START;
}

static void CopyBlockDMA2D(uint32_t* src, uint32_t* dst, int width, int height) {
    while (hdma2d.Instance->CR & DMA2D_CR_START);
    hdma2d.Instance->CR = DMA2D_M2M;
    hdma2d.Instance->OPFCCR = DMA2D_OUTPUT_ARGB8888;
    hdma2d.Instance->FGPFCCR = DMA2D_INPUT_ARGB8888;
    hdma2d.Instance->FGMAR = (uint32_t)src;
    hdma2d.Instance->OMAR = (uint32_t)dst;
    hdma2d.Instance->FGOR = 0;
    hdma2d.Instance->OOR = 480 - width;
    hdma2d.Instance->NLR = (width << 16) | height;
    hdma2d.Instance->CR |= DMA2D_CR_START;
}
